AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РазмещениеЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РазмещениеЗаказовПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТоварТара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТоварТара</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СинонимыПроизводителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СинонимыПроизводителей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СинонимПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПоступленияТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(Общ) Поступление на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПТОХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПТОХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправленИнвойс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленИнвойс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СторонниеСклады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СторонниеСклады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВАварду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьПоРабочмДням</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьПоСубботам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьПоВоскресеньям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВПраздничныеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВПредраздничныеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиРабочийДень</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиРабочийДень2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиРабочийДень3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиСуббота</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиСуббота2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиСуббота3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиВоскресенье</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиВоскресенье2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиВоскресенье3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиПраздничныйДень</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиПраздничныйДень2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиПраздничныйДень3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиПредпрздничныйДень</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиПредпрздничныйДень2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиПредпрздничныйДень3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкоростьПоставки</Name>
					<Comment>(дней)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараллельнаяОтправкаЗаказовВУТ11</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьЗаказыПоСкладуВУТ11</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентСторСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСторСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтороннийСкладФилиала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьЗаказыВSI</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/CreateInvoice/Ext/Module.bsl
Функция CreateInvoice(СкладКодМДМ, КонтрагентКодМДМ, КонтрагентИНН, КонтрагентКПП, НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика, 
	                  СуммаВсегоСНДС, СуммаНДС, ПополнениеПоПерекупке, ТОХ_МХ1, Товары)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис CreateInvoice", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. CreateInvoice");  
	
	НовыйДокумент = Неопределено;
	
	Если ТОХ_МХ1 Тогда
		СтруктураДанных = СоздатьПоступлениеТОХ(СкладКодМДМ, КонтрагентКодМДМ, КонтрагентИНН, КонтрагентКПП, НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика, 
		                СуммаВсегоСНДС, СуммаНДС, ПополнениеПоПерекупке, ТОХ_МХ1, Товары, ВремяНачалаUTC);
	Иначе
		СтруктураДанных = СоздатьПТУ(СкладКодМДМ, КонтрагентКодМДМ, КонтрагентИНН, КонтрагентКПП, НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика, 
		                СуммаВсегоСНДС, СуммаНДС, ПополнениеПоПерекупке, ТОХ_МХ1, Товары, ВремяНачалаUTC, НовыйДокумент);
	КонецЕсли; 
	
	Если СтруктураДанных.status = "OK" И Не НовыйДокумент = Неопределено Тогда
		ОтправитьПТУвУТ11(НовыйДокумент);			
	КонецЕсли;	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис CreateInvoice", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateInvoice " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);
	
КонецФункции

Функция СоздатьПТУ(СкладКодМДМ, КонтрагентКодМДМ, КонтрагентИНН, КонтрагентКПП, НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика, СуммаВсегоСНДС, 
	                    СуммаНДС, ПополнениеПоПерекупке, ТОХ_МХ1, Товары, ВремяНачалаUTC, НовыйДокумент)

	ПараметрыСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(Товары);
	ТЗНоменклатуры = ПараметрыСтруктура.Товары; 
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("status","");
	СтруктураДанных.Вставить("message","");
	СтруктураДанных.Вставить("invoice","");
	СтруктураДанных.Вставить("repurchase", false);
	
	Если ТЗНоменклатуры.Количество() = 0 Тогда 
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Не заполнен список товаров";
		СтруктураДанных.invoice = "ERROR";
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис CreateInvoice", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateInvoice " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);
		
	КонецЕсли;
	
	НомерПоДаннымПоставщика = СокрЛП(НомерПоДаннымПоставщика);	
	
	ЕстьДокументПТУ  = НайтиДокументПТУПоНомеруИДате(НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика);
	
	Если ЗначениеЗаполнено(ЕстьДокументПТУ) Тогда
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Уже существует документ с НомерПоДаннымПоставщика = " + НомерПоДаннымПоставщика + " и ДатаПоДаннымПоставщика = " + ДатаПоДаннымПоставщика;
		СтруктураДанных.invoice = СокрЛП(ЕстьДокументПТУ.Номер);
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис CreateInvoice", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateInvoice " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);	
		
	КонецЕсли; 
	
	ЕстьОшибкиЗагрузки     = Ложь;
	ОписаниеОшибкиЗагрузки = ""; 
	
	СтороннийСклад = Справочники.СторонниеСклады.НайтиПоРеквизиту("КодМДМ", СкладКодМДМ);
	
	Если ЗначениеЗаполнено(СтороннийСклад) Тогда
		
		Контрагент = СтороннийСклад.КонтрагентСторСклада;
		
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда  
			
			ЕстьОшибкиЗагрузки = Истина;
			ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Не заполнен Контрагент для склада " + СокрЛП(СтороннийСклад.Наименование) + ".";
			
		Иначе
			
			//+Шульман А. 17.04.2025 #UT11-5557
			Если Контрагент.ЗагружатьУПДОтКонтрагентаИзЭДО Тогда
				
				ЕстьОшибкиЗагрузки = Истина;
				ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + 
				 " По контрагенту " + Строка(Контрагент) + ", ИНН " + КонтрагентИНН + " установлено получение УПД из ЭДО";
				
			КонецЕсли;
			//-Шульман А. 17.04.2025 #UT11-5557
			
		КонецЕсли;	
		
		Договор = СтороннийСклад.ДоговорСторСклада;		
		
		Если НЕ ЗначениеЗаполнено(Договор) Тогда       
			
			ЕстьОшибкиЗагрузки = Истина;
			ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Не заполнен Договор для склада " + СокрЛП(СтороннийСклад.Наименование) + ".";
			
		КонецЕсли; 
		
	Иначе
		
		ЕстьОшибкиЗагрузки = Истина;
		ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Не найден сторонний склад по коду МДМ " + СокрЛП(СкладКодМДМ) + ".";
		
	КонецЕсли;	
	
	ЕстьЭлементВСправочникеНесозданныеПТУ  = НайтиЭлементВНесозданныхПТУ(СтороннийСклад, НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика); 
	
	Если НЕ  ЕстьЭлементВСправочникеНесозданныеПТУ.Пустая() Тогда 
		
		ОписаниеОшибкиЗагрузки = " Для документа с номером "+НомерПоДаннымПоставщика+" от  " + ДатаПоДаннымПоставщика + " уже есть запись в справочнике Несозданные ПТУ №"
		 + ЕстьЭлементВСправочникеНесозданныеПТУ.Код + " от " + ЕстьЭлементВСправочникеНесозданныеПТУ.Дата + ". Ошибки в справочнике :" 
		 + СокрЛП(ЕстьЭлементВСправочникеНесозданныеПТУ.Причина);
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = СокрЛП(ОписаниеОшибкиЗагрузки);
		СтруктураДанных.invoice = "ERROR";
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис CreateInvoice", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateInvoice " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);
		
	Иначе
		
		НеСозданныйПТУ 						   = Справочники.НеСозданныеПТУ.СоздатьЭлемент();
		НеСозданныйПТУ.Дата 				   = ТекущаяДата();
		НеСозданныйПТУ.ПТОХ                    = Ложь;
		НеСозданныйПТУ.КодМДМСклада			   = СкладКодМДМ;
		НеСозданныйПТУ.СтороннийСклад          = СтороннийСклад;
		НеСозданныйПТУ.НомерПоДаннымПоставщика = НомерПоДаннымПоставщика;		
		НеСозданныйПТУ.ДатаПоДаннымПоставщика  = ДатаПоДаннымПоставщика;
		НеСозданныйПТУ.Комментарий			   = "Загружен из SI через Web-сервис ";	
		НеСозданныйПТУ.Наименование            = "Загрузка ПТУ по складу " + ?(ЗначениеЗаполнено(СтороннийСклад), СтороннийСклад.Наименование, СкладКодМДМ);
		
		ЕстьОшибкиВТЧ = Ложь;
		ТабличнаяЧастьДокумента = ЗаполнитьТабличнуюЧастьИзПараметраДляПТУ(Договор, ТЗНоменклатуры,ЕстьОшибкиВТЧ); 
		
		Если ЕстьОшибкиВТЧ Тогда	
			
			СтрокаОшибки = "";
			
			Для Каждого СтрокаТаблЧасти Из ТабличнаяЧастьДокумента Цикл
				
				Если СтрокаТаблЧасти.ЕстьОшибка Тогда
					СтрокаОшибки = СтрокаОшибки + "По номенклатуре с кодом " + СокрЛП(СтрокаТаблЧасти.ФормализованныйКод) + " возникла ошибка :"
					 + СокрЛП(СтрокаТаблЧасти.ОписаниеОшибки) + ".";
				КонецЕсли;
				
			КонецЦикла; 	
			
			ЕстьОшибкиЗагрузки = Истина;
			ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + СтрокаОшибки + ".";
			
		КонецЕсли;
	КонецЕсли;
	
	
	Если ЕстьОшибкиЗагрузки Тогда 
		
		НеСозданныйПТУ.Товары.Загрузить(ТабличнаяЧастьДокумента);
		НеСозданныйПТУ.Причина = СокрЛП(ОписаниеОшибкиЗагрузки);
		НеСозданныйПТУ.Записать(); 
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = СокрЛП(ОписаниеОшибкиЗагрузки) + " В справочнике Несозданные ПТУ добавлена запись с № " + НеСозданныйПТУ.Код + " от " + НеСозданныйПТУ.Дата + ".";
		СтруктураДанных.invoice = "ERROR";

	Иначе 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Товары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Заказов
		|ИЗ
		|	&ВТ_Товары КАК ВТ_Товары
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
		|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	СУММА(ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0)) КАК КоличествоЗаказаноУПоставщика,
		|	СУММА(ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0)) КАК КоличествоЗаказаноПокупателем
		|ПОМЕСТИТЬ ТабДанных
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
		|			,        
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_Заказов.Номенклатура
		|					ИЗ
		|						ВТ_Заказов)
		|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК ЗаказыПоставщикамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
		|				,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_Заказов.Номенклатура
		|						ИЗ
		|							ВТ_Заказов)
		|					И ЗаказПоставщику.ДоговорКонтрагента = &ДоговорКонтрагента) КАК РазмещениеЗаказовПокупателейОстатки
		|		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику
		|			И ЗаказыПоставщикамОстатки.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПоставщикамОстатки.Номенклатура,
		|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабДанных.Номенклатура,
		|	ТабДанных.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ТабДанных.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТабДанных.КоличествоЗаказаноУПоставщика,
		|	ТабДанных.КоличествоЗаказаноПокупателем
		|ИЗ
		|	ТабДанных КАК ТабДанных
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПоставщику,
		|	ЗаказПокупателя
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабДанных.Номенклатура КАК Номенклатура,
		|	ТабДанных.ЗаказПоставщику КАК ЗаказПоставщику,  
		//+Шульман А. 24.04.2025 #UT10-5173
		|	ТабДанных.ЗаказПоставщику.ПремиальнаяПерекупка КАК ПремиальнаяПерекупка,     
		//-Шульман А. 24.04.2025 #UT10-5173
		|	МАКСИМУМ(ТабДанных.КоличествоЗаказаноУПоставщика) КАК КоличествоЗаказаноУПоставщика
		|ИЗ
		|	ТабДанных КАК ТабДанных
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабДанных.Номенклатура,
		|	ТабДанных.ЗаказПоставщику,
		//+Шульман А. 24.04.2025 #UT10-5173
		|	ТабДанных.ЗаказПоставщику.ПремиальнаяПерекупка     
		//-Шульман А. 24.04.2025 #UT10-5173
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	ЗаказПоставщику
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ВТ_Товары", ТабличнаяЧастьДокумента.Скопировать(,"Номенклатура")); 
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);      
		
		Результат = Запрос.ВыполнитьПакет();
		
		ТабЗаказов = Результат[2].Выгрузить();
		ТабЗаказовПоставщику = Результат[3].Выгрузить();  
		
		
		// Новый документ 
		НовыйДокумент = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		
		НовыйДокумент.Дата							= ТекущаяДата();	
		НовыйДокумент.Организация 					= Договор.Организация;
		НовыйДокумент.Контрагент  					= Контрагент;	
		НовыйДокумент.ДоговорКонтрагента 		 	= Договор;
		НовыйДокумент.ВалютаДокумента 				= Договор.ВалютаВзаиморасчетов;    
		НовыйДокумент.ТипЦен					    = Договор.ТипЦен; 
		НовыйДокумент.СкладОрдер 					= Константы.ОсновнойСклад.Получить();	
		НовыйДокумент.ВидПоступления  		        = Перечисления.ВидыПоступленияТоваров.НаСклад;
		НовыйДокумент.Экспресс 						= Ложь;
		НовыйДокумент.ОтражатьВУправленческомУчете  = Истина;
		НовыйДокумент.ОтражатьВБухгалтерскомУчете 	= Истина;
		НовыйДокумент.ОтражатьВНалоговомУчете 		= Истина;
		НовыйДокумент.КратностьВзаиморасчетов 		= 1;
		НовыйДокумент.КурсВзаиморасчетов  			= 1;	
		НовыйДокумент.СуммаВключаетНДС 				= Истина;
		НовыйДокумент.УчитыватьНДС 					= Истина;
		НовыйДокумент.ДатаВходящегоДокумента 		= ДатаПоДаннымПоставщика;
		НовыйДокумент.НомерВходящегоДокумента 		= НомерПоДаннымПоставщика; 
		НовыйДокумент.Комментарий 					= "Документ загружен из SI через Web-сервис " + ТекущаяДата(); 
		
		//+Шульман А. 24.04.2025 #UT10-5173  
		тзСтрока = ТабЗаказовПоставщику.Найти(Истина, "ПремиальнаяПерекупка"); 
		
		Если Не тзСтрока = Неопределено Тогда
			НовыйДокумент.ПремиальнаяПерекупка = Истина;
		КонецЕсли;
		//-Шульман А. 24.04.2025 #UT10-5173
		
		ИтоговаяСуммаНДС = ТабличнаяЧастьДокумента.Итог("СуммаНДС");
		
		Для Каждого СтрокаТаблицаИзФайла Из ТабличнаяЧастьДокумента Цикл  
			
			Номенклатура = СтрокаТаблицаИзФайла.Номенклатура;
			ТекКоличество = СтрокаТаблицаИзФайла.Количество; 
			
			НайденнаяНоменклатура  =  ТабЗаказовПоставщику.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура)); 
			
			Для каждого ТекЗаказПоставщику Из НайденнаяНоменклатура Цикл 
				
				Если ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика <=0 Тогда 
					Продолжить;                                         
				КонецЕсли;
				
				Если ТекКоличество <= 0 Тогда      
					Прервать;                     
				КонецЕсли;
				
				НайденныеЗаказы =  ТабЗаказов.НайтиСтроки(Новый Структура("Номенклатура,ЗаказПоставщику", ТекЗаказПоставщику.Номенклатура, ТекЗаказПоставщику.ЗаказПоставщику));    
				
				Для каждого ТекЗаказ Из НайденныеЗаказы Цикл     
					
					Если ТекЗаказ.КоличествоЗаказаноПокупателем <=0 Тогда    
						Продолжить;           
					КонецЕсли;
					
					Если ТекКоличество > 0 Тогда
						
						СтруктураСтроки = Новый Структура();
						СтруктураСтроки.Вставить("Документ", 					НовыйДокумент);
						СтруктураСтроки.Вставить("Номенклатура", 				Номенклатура);
						СтруктураСтроки.Вставить("ТекСтрока", 					ТекЗаказ);
						СтруктураСтроки.Вставить("ТекКоличество", 		    	Мин(ТекКоличество, ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика, ТекЗаказ.КоличествоЗаказаноПокупателем));
						СтруктураСтроки.Вставить("БратьУказанноеКоличество", 	Истина);
						СтруктураСтроки.Вставить("СерияНоменклатуры", 			СтрокаТаблицаИзФайла.СерияНоменклатуры);
						СтруктураСтроки.Вставить("Цена", 				    	СтрокаТаблицаИзФайла.Цена);
						СтруктураСтроки.Вставить("ЗаказПоставщикуУказан", 		Истина);
						СтруктураСтроки.Вставить("ЗаказПокупателяУказан", 	    Истина);
						СтруктураСтроки.Вставить("ЗаказПоставщику", 			ТекЗаказПоставщику.ЗаказПоставщику);
						
						НоваяСтрокаДокумента = СоздатьНовуюСтрочкуВДокументе(СтруктураСтроки);
						
						ТекЗаказ.КоличествоЗаказаноПокупателем = ТекЗаказ.КоличествоЗаказаноПокупателем - НоваяСтрокаДокумента.Количество;
						ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика = ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика - НоваяСтрокаДокумента.Количество;
						ТекКоличество = ТекКоличество - НоваяСтрокаДокумента.Количество; 
						
					КонецЕсли;
				КонецЦикла;
				
				// заказано в заказе поставщика не по заказу покупателя
				Если ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика > 0  И  ТекКоличество > 0 Тогда
					
					СтруктураСтроки = Новый Структура();
					СтруктураСтроки.Вставить("Документ", 					НовыйДокумент);
					СтруктураСтроки.Вставить("Номенклатура", 				Номенклатура);
					СтруктураСтроки.Вставить("ТекСтрока", 					ТекЗаказ);
					СтруктураСтроки.Вставить("ТекКоличество", 			    Мин(ТекКоличество,	ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика));
					СтруктураСтроки.Вставить("БратьУказанноеКоличество", 	Истина);
					СтруктураСтроки.Вставить("СерияНоменклатуры", 			СтрокаТаблицаИзФайла.СерияНоменклатуры);
					СтруктураСтроки.Вставить("Цена    ", 					СтрокаТаблицаИзФайла.Цена);
					СтруктураСтроки.Вставить("ЗаказПоставщикуУказан", 		Истина);
					СтруктураСтроки.Вставить("ЗаказПокупателяУказан", 	    Ложь);
					СтруктураСтроки.Вставить("ЗаказПоставщику", 			ТекЗаказПоставщику.ЗаказПоставщику);
					
					НоваяСтрокаДокумента = СоздатьНовуюСтрочкуВДокументе(СтруктураСтроки);
					
					ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика = ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика - НоваяСтрокаДокумента.Количество;
					ТекКоличество = ТекКоличество - НоваяСтрокаДокумента.Количество; 
					
				КонецЕсли;
				
			КонецЦикла;  
			
			// пришло товара больше чем заказывали
			Если ТекКоличество > 0 Тогда
				
				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("Документ", 					НовыйДокумент);
				СтруктураСтроки.Вставить("Номенклатура", 				Номенклатура);
				СтруктураСтроки.Вставить("ТекСтрока", 					ТекЗаказ);
				СтруктураСтроки.Вставить("ТекКоличество", 			    ТекКоличество);
				СтруктураСтроки.Вставить("БратьУказанноеКоличество", 	Истина);
				СтруктураСтроки.Вставить("СерияНоменклатуры", 			СтрокаТаблицаИзФайла.СерияНоменклатуры);
				СтруктураСтроки.Вставить("Цена", 					    СтрокаТаблицаИзФайла.Цена);
				СтруктураСтроки.Вставить("ЗаказПоставщикуУказан", 		Ложь);
				СтруктураСтроки.Вставить("ЗаказПокупателяУказан", 	    Ложь);
				СтруктураСтроки.Вставить("ЗаказПоставщику", 			Неопределено);
				
				НоваяСтрокаДокумента = СоздатьНовуюСтрочкуВДокументе(СтруктураСтроки);
				
				ТекКоличество = ТекКоличество - НоваяСтрокаДокумента.Количество; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		НовыйДокумент.СуммаДокумента = НовыйДокумент.Товары.Итог("Сумма");
		НовыйДокумент.Товары.Сортировать("Номенклатура");  
		
		РазницаНДС = ИтоговаяСуммаНДС - НовыйДокумент.Товары.Итог("СуммаНДС"); 
		
		Если РазницаНДС <> 0 Тогда 
			НовыйДокумент.Товары[0].СуммаНДС = НовыйДокумент.Товары[0].СуммаНДС+РазницаНДС;     
		КонецЕсли;
		
		Для Каждого СтрокаТовары Из НовыйДокумент.Товары Цикл

			Если ЗначениеЗаполнено(СтрокаТовары.ЗаказПоставщику) И СтрокаТовары.ЗаказПоставщику.Экспресс Тогда
				
				НовыйДокумент.Экспресс = Истина;			
				Прервать;             
				
			КонецЕсли;
		КонецЦикла;

		ТаблицаНомеров = НовыйДокумент.Товары.Выгрузить(, "ЗаказПоставщику");
		ТаблицаНомеров.Свернуть("ЗаказПоставщику"); 
		
		Для Каждого СтрокаЗаказы Из ТаблицаНомеров Цикл   
			
			Если ЗначениеЗаполнено(СтрокаЗаказы.ЗаказПоставщику) И ЗначениеЗаполнено(СтрокаЗаказы.ЗаказПоставщику.КодОтправкиАварда) Тогда
				
				ПромНомерДокумента = СокрЛП(СтрокаЗаказы.ЗаказПоставщику.КодОтправкиАварда);					
				НовыйДокумент.НомерСкладскогоДокумента = НовыйДокумент.НомерСкладскогоДокумента + ?(СокрЛП(НовыйДокумент.НомерСкладскогоДокумента) = "", "", ";") 
				+ СокрЛП(ПромНомерДокумента); 
				
			КонецЕсли;
			
		КонецЦикла;  
		
		//+Гавриленков В. 15.01.2025 #UT10-5031
		Если Не ЗначениеЗаполнено(НовыйДокумент.НомерСкладскогоДокумента) Тогда
			НовыйДокумент.НомерСкладскогоДокумента = НовыйДокумент.НомерВходящегоДокумента;
		КонецЕсли;
		//-Гавриленков В. 15.01.2025 #UT10-5031
		
		Попытка  
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			СтруктураДанных.status = "OK";                                                                                              
			СтруктураДанных.invoice = СокрЛП(НовыйДокумент.Номер);
			СтруктураДанных.message = "Успешно создан ПТУ " + СокрЛП(НовыйДокумент.Номер);
			
		Исключение	
			
			ЕстьОшибкиЗагрузки = Истина;
			ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Не удалось записать ПТУ с НомерПоДаннымПоставщика = " + НомерПоДаннымПоставщика + " По причине: " + Символы.ПС + ОписаниеОшибки()  + ".";
			
		КонецПопытки;
		
		Если ЕстьОшибкиЗагрузки Тогда
			
			СтруктураДанных.status = "ERROR";
			СтруктураДанных.message = СокрЛП(ОписаниеОшибкиЗагрузки);
			СтруктураДанных.invoice = "ERROR";
			
		Иначе
			
			//+Кабанов А.В. 12.11.2024 #UT10-4872	
			УстановитьПривилегированныйРежим(Истина);
			
			Попытка			
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Исключение
			КонецПопытки;
			
			УстановитьПривилегированныйРежим(Истина);
			//-Кабанов А.В. 12.11.2024 #UT10-4872			
			
		КонецЕсли;
		
	КонецЕсли;              
	
	Возврат СтруктураДанных;

КонецФункции

Функция СоздатьПоступлениеТОХ(СкладКодМДМ, КонтрагентКодМДМ, КонтрагентИНН, КонтрагентКПП, НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика, 
	         СуммаВсегоСНДС, СуммаНДС, ПополнениеПоПерекупке, ТОХ_МХ1, Товары, ВремяНачалаUTC)

	ПараметрыСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(Товары);
	ТЗНоменклатуры = ПараметрыСтруктура.Товары; 
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("status","");
	СтруктураДанных.Вставить("message","");
	СтруктураДанных.Вставить("invoice","");
	СтруктураДанных.Вставить("repurchase",false);
	
	Если ТЗНоменклатуры.Количество() = 0 Тогда 
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Не заполнен список товаров";
		СтруктураДанных.invoice = "ERROR";
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис CreateInvoice", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateInvoice " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);
		
	КонецЕсли;

	ЕстьОшибкиЗагрузки     = Ложь;
	ОписаниеОшибкиЗагрузки = ""; 
	ПоставщикТОХ		   = Справочники.ПоставщикиТОХ.ПустаяСсылка();
	
	Контрагент  = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", КонтрагентКодМДМ);
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		
		ЗапросПоставщиковТОХ = Новый Запрос;
		ЗапросПоставщиковТОХ.Текст =
		"ВЫБРАТЬ
		|	ПоставщикиТОХ.Ссылка  КАК ПоставщикТОХ,
		|	ПоставщикиТОХ.Контрагент,
		|	ПоставщикиТОХ.ДоговорКонтрагента,
		|	ПоставщикиТОХ.Наименование
		|ИЗ
		|	Справочник.ПоставщикиТОХ КАК ПоставщикиТОХ
		|ГДЕ
		|	НЕ ПоставщикиТОХ.ПометкаУдаления
		|	И ПоставщикиТОХ.Контрагент = &Контрагент";
		
		ЗапросПоставщиковТОХ.УстановитьПараметр("Контрагент",Контрагент);
		
		РезультатЗапросапостащиковТОХ = ЗапросПоставщиковТОХ.Выполнить().Выгрузить();
		
		Если  РезультатЗапросапостащиковТОХ.Количество() = 0 Тогда  
			
			ЕстьОшибкиЗагрузки = Истина;
			ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Не найден поставщик ТОХ для контрагента " + СокрЛП(Контрагент.Наименование) + ".";
			
		ИначеЕсли РезультатЗапросапостащиковТОХ.Количество() > 1 Тогда
			
			ЕстьОшибкиЗагрузки = Истина;
			ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Найдено больше одного поставщика ТОХ для контрагента " + СокрЛП(Контрагент.Наименование) + ".";
			
		Иначе
			
			Договор = РезультатЗапросапостащиковТОХ[0].ДоговорКонтрагента;
			
			Если НЕ ЗначениеЗаполнено(Договор) Тогда       
				
				ЕстьОшибкиЗагрузки = Истина;
				ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Не заполнен Договор для постащика ТОХ  " + СокрЛП(РезультатЗапросапостащиковТОХ[0].Наименование) + ".";
				
			КонецЕсли;    
			
			ПоставщикТОХ = РезультатЗапросапостащиковТОХ[0].ПоставщикТОХ;
			
		КонецЕсли;       
		
	Иначе
		
		ЕстьОшибкиЗагрузки = Истина;
		ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Не найден контрагент по коду МДМ " + СокрЛП(КонтрагентКодМДМ) + ".";
		
	КонецЕсли;	
	
	ЕстьЭлементВСправочникеНесозданныеПТУ  = НайтиЭлементВНесозданныхПТУ(ПоставщикТОХ,НомерПоДаннымПоставщика,ДатаПоДаннымПоставщика);  
	
	Если НЕ  ЕстьЭлементВСправочникеНесозданныеПТУ.Пустая() Тогда 
		
		ОписаниеОшибкиЗагрузки = " Для документа с номером " + НомерПоДаннымПоставщика + " от  " + ДатаПоДаннымПоставщика + " уже есть запись в справочнике Несозданные ПТУ №" 
		          + ЕстьЭлементВСправочникеНесозданныеПТУ.Код + " от " + ЕстьЭлементВСправочникеНесозданныеПТУ.Дата + ". Ошибки в справочнике : " 
				  + СокрЛП(ЕстьЭлементВСправочникеНесозданныеПТУ.Причина);
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = СокрЛП(ОписаниеОшибкиЗагрузки);
		СтруктураДанных.invoice = "ERROR";
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис CreateInvoice", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateInvoice " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);
		
	Иначе
		
		НеСозданныйПТУ 						   = Справочники.НеСозданныеПТУ.СоздатьЭлемент();
		НеСозданныйПТУ.Дата 				   = ТекущаяДата();
		НеСозданныйПТУ.ПТОХ                    = Истина;
		НеСозданныйПТУ.КодМДМСклада			   = СкладКодМДМ;
		НеСозданныйПТУ.СтороннийСклад          = ПоставщикТОХ;
		НеСозданныйПТУ.НомерПоДаннымПоставщика = НомерПоДаннымПоставщика;
		НеСозданныйПТУ.ДатаПоДаннымПоставщика  = ДатаПоДаннымПоставщика;
		НеСозданныйПТУ.Комментарий			   = "Загружен из SI через Web-сервис ";	
		НеСозданныйПТУ.Наименование			   = "Загрузка поступление ТОХ по контрагенту " + ?(ЗначениеЗаполнено(Контрагент), Контрагент.Наименование, КонтрагентКодМДМ);
		
		ЕстьОшибкиВТЧ = Ложь;
		ТабличнаяЧастьДокумента = ЗаполнитьТабличнуюЧастьИзПараметраДляПТОХ(ПоставщикТОХ, ТЗНоменклатуры, ЕстьОшибкиВТЧ); 
		
		Если ЕстьОшибкиВТЧ Тогда	
			
			СтрокаОшибки = "";
			
			Для Каждого СтрокаТаблЧасти Из ТабличнаяЧастьДокумента Цикл
				
				Если СтрокаТаблЧасти.ЕстьОшибка Тогда
					СтрокаОшибки = СтрокаОшибки+"По номенклатуре с кодом " + СокрЛП(СтрокаТаблЧасти.ФормализованныйКод) + " возникла ошибка : " 
					+ СокрЛП(СтрокаТаблЧасти.ОписаниеОшибки) + ".";
				КонецЕсли;
				
			КонецЦикла; 	
			
			ЕстьОшибкиЗагрузки = Истина;
			ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + СтрокаОшибки + ".";
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьОшибкиЗагрузки Тогда 
		
		НеСозданныйПТУ.Товары.Загрузить(ТабличнаяЧастьДокумента);
		НеСозданныйПТУ.Причина = СокрЛП(ОписаниеОшибкиЗагрузки);
		НеСозданныйПТУ.Записать(); 
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = СокрЛП(ОписаниеОшибкиЗагрузки) + " В справочнике Несозданные ПТУ добавлена запись с № " + НеСозданныйПТУ.Код + " от " + НеСозданныйПТУ.Дата + ".";
		СтруктураДанных.invoice = "ERROR";
		
	Иначе 
		
		НовыйДокумент = Документы.ПоступлениеТоваровНаОтветственноеХранение.СоздатьДокумент(); 
		НовыйДокумент.Ответственный	           = ПараметрыСеанса.ТекущийПользователь;
		НовыйДокумент.Дата			           = ТекущаяДата();
		НовыйДокумент.ВалютаДокумента          = Справочники.Валюты.НайтиПоКоду("643");
		НовыйДокумент.Контрагент               = Контрагент;
		НовыйДокумент.ДоговорКонтрагента       = Договор;
		НовыйДокумент.КратностьВзаиморасчетов  = 1;
		НовыйДокумент.КурсВзаиморасчетов       = 1;
		НовыйДокумент.Организация              = Договор.Организация;
		НовыйДокумент.Склад                    = Константы.ОсновнойСклад.Получить();
		НовыйДокумент.ДатаВходящегоДокумента   = ДатаПоДаннымПоставщика;
		НовыйДокумент.НомерВходящегоДокумента  = НомерПоДаннымПоставщика; 
		НовыйДокумент.НомерСкладскогоДокумента = НомерПоДаннымПоставщика;
		НовыйДокумент.Комментарий 			   = "Документ загружен из SI через Web-сервис " + ТекущаяДата();		
		
		Если НовыйДокумент.ДоговорКонтрагента.ДоставкаЧерезСкладТомилино Тогда 
			НовыйДокумент.Статус 			   = Перечисления.СтатусыПТОХ.НеОтправленИнвойс;
		КонецЕсли;		
		
		Для Каждого СтрокаТаблицаИзФайла Из ТабличнаяЧастьДокумента Цикл 
			
			НоваяСтрокаДокумента                   = НовыйДокумент.Товары.Добавить(); 			
			НоваяСтрокаДокумента.Номенклатура      = СтрокаТаблицаИзФайла.Номенклатура;
			НоваяСтрокаДокумента.ЕдиницаИзмерения  = СтрокаТаблицаИзФайла.ЕдиницаИзмерения;
			НоваяСтрокаДокумента.Коэффициент       = СтрокаТаблицаИзФайла.Коэффициент;
			НоваяСтрокаДокумента.Количество        = СтрокаТаблицаИзФайла.Количество;
			НоваяСтрокаДокумента.Сумма             = СтрокаТаблицаИзФайла.Сумма; 
			НоваяСтрокаДокумента.Цена              = СтрокаТаблицаИзФайла.Цена;
			НоваяСтрокаДокумента.СерияНоменклатуры = СтрокаТаблицаИзФайла.СерияНоменклатуры;
			
		КонецЦикла; 
		
		НовыйДокумент.СуммаДокумента = НовыйДокумент.Товары.Итог("Сумма");
		НовыйДокумент.Товары.Сортировать("Номенклатура");
				
		Попытка  
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			СтруктураДанных.status = "OK";                                                                                              
			СтруктураДанных.invoice = СокрЛП(НовыйДокумент.Номер);
			СтруктураДанных.message = "Успешно создано поступление ТОХ " + СокрЛП(НовыйДокумент.Номер);
			
		Исключение	
			
			ЕстьОшибкиЗагрузки = Истина;
			ОписаниеОшибкиЗагрузки = ОписаниеОшибкиЗагрузки + " Не удалось записать поступление ТОХ с НомерПоДаннымПоставщика = "
			 + НомерПоДаннымПоставщика + " По причине: " + Символы.ПС + ОписаниеОшибки() + ".";
			
		КонецПопытки;
		
		Если ЕстьОшибкиЗагрузки Тогда
			
			СтруктураДанных.status = "ERROR";
			СтруктураДанных.message = СокрЛП(ОписаниеОшибкиЗагрузки);
			СтруктураДанных.invoice = "ERROR"; 
			
		Иначе
			
			УстановитьПривилегированныйРежим(Истина);
			
			Попытка			
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Исключение
			КонецПопытки;
			
			УстановитьПривилегированныйРежим(Истина);
			
		КонецЕсли;

	КонецЕсли;   
	
	Возврат СтруктураДанных;

КонецФункции

Функция НайтиДокументПТУПоНомеруИДате(НомерДокументаУПД, ДатаДокументаУПД)  
	
	ЗапросПТУ = Новый Запрос;
	ЗапросПТУ.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК ДокПТУ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
	|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента
	|	И НЕ ПоступлениеТоваровУслуг.ПометкаУдаления";
	
	ЗапросПТУ.УстановитьПараметр("ДатаВходящегоДокумента", ДатаДокументаУПД);
	ЗапросПТУ.УстановитьПараметр("НомерВходящегоДокумента", НомерДокументаУПД);
	
	РезультатЗапросаПТУ = ЗапросПТУ.Выполнить().Выгрузить();
	
	Если НЕ РезультатЗапросаПТУ.Количество() = 0 Тогда
		Возврат РезультатЗапросаПТУ[0].ДокПТУ;
	Иначе
		Возврат Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция  ЗаполнитьТабличнуюЧастьИзПараметраДляПТУ(Договор, ТЗНоменклатура, ЕстьОшибки)
	
	ПромТаблТовары = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент().Товары.Выгрузить(,"Номенклатура,СерияНоменклатуры,ЕдиницаИзмерения,Коэффициент,Количество,Цена,Сумма,СуммаНДС"); 
	ПромТаблТовары.Колонки.Добавить("ЕстьОшибка", Новый ОписаниеТипов("Булево")); 
	ПромТаблТовары.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50))); 
	ПромТаблТовары.Колонки.Добавить("ФормализованныйКод", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50))); 
	ПромТаблТовары.Колонки.Добавить("КодПроизводителя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50))); 
	ПромТаблТовары.Колонки.Добавить("ГТД", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));	
	ПромТаблТовары.Колонки.Добавить("Страна", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	
	ЗапросТоваровПоставщика = Новый Запрос;
	
	ЗапросТоваровПоставщика.УстановитьПараметр("Договор",Договор);
	
	ЗапросТоваровПоставщика.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура.Родитель,
	|	ЗаказыПоставщикамОстатки.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ВЫРАЗИТЬ(""                                                  "" КАК СТРОКА(50)) КАК НормализованныйКодПроизводителя,
	|	ЗаказыПоставщикамОстатки.Номенклатура
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ДоговорКонтрагента = &Договор) КАК ЗаказыПоставщикамОстатки";
	
	РезультатЗапросаТоваровПостащика = ЗапросТоваровПоставщика.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблТоваровПоставщика Из РезультатЗапросаТоваровПостащика Цикл
		СтрокаТаблТоваровПоставщика.НормализованныйКодПроизводителя = НормализоватьКодпроизводителя(СтрокаТаблТоваровПоставщика.КодПроизводителя);
	КонецЦикла;
	
	Для Каждого СтрокаНайтиТовар Из ТЗНоменклатура Цикл 
		
		НоваяСтрокаДокумента =  ПромТаблТовары.Добавить(); 
		
		ПромАртикул = СокрЛП(СтрокаНайтиТовар.ФормализованныйКод);
		НормализованныйАртикул = НормализоватьКодпроизводителя(ПромАртикул); 
		
		ЕстьТоварВТоварахПоставщика = РезультатЗапросаТоваровПостащика.НайтиСтроки(Новый Структура("НормализованныйКодПроизводителя", НормализованныйАртикул));
		
		ЕстьНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
		
		Если ЕстьТоварВТоварахПоставщика.Количество() = 1 Тогда      
			ЕстьНоменклатура = ЕстьТоварВТоварахПоставщика[0].Номенклатура;
		Иначе                      
			
			ЕстьОшибки = Истина;
			НоваяСтрокаДокумента.ЕстьОшибка = Истина;   
			НоваяСтрокаДокумента.ОписаниеОшибки = ?(ЕстьТоварВТоварахПоставщика.Количество() = 0 , "Товар не найден", "Найдено более одного товара")
			
		КонецЕсли; 
		
		НоваяСтрокаДокумента.КодПроизводителя = ПромАртикул;
		НоваяСтрокаДокумента.ФормализованныйКод = НормализованныйАртикул; 
		НоваяСтрокаДокумента.Номенклатура = ЕстьНоменклатура;		
		НоваяСтрокаДокумента.ЕдиницаИзмерения  = НоваяСтрокаДокумента.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрокаДокумента.Коэффициент = НоваяСтрокаДокумента.ЕдиницаИзмерения.Коэффициент;
		НоваяСтрокаДокумента.Количество = Число(СтрокаНайтиТовар.Количество);
		НоваяСтрокаДокумента.Сумма = Число(СтрокаНайтиТовар.Сумма); 
		НоваяСтрокаДокумента.СуммаНДС = Число(СтрокаНайтиТовар.СуммаНДС);  
		НоваяСтрокаДокумента.Цена = 0;        
		
		Если НоваяСтрокаДокумента.Сумма = 0 И НЕ НоваяСтрокаДокумента.Цена = 0 Тогда 
			НоваяСтрокаДокумента.Сумма = НоваяСтрокаДокумента.Цена * НоваяСтрокаДокумента.Количество; 
		ИначеЕсли НЕ НоваяСтрокаДокумента.Сумма = 0 И  НоваяСтрокаДокумента.Цена = 0 Тогда 
			НоваяСтрокаДокумента.Цена = НоваяСтрокаДокумента.Сумма / ?(НоваяСтрокаДокумента.Количество = 0, 1, НоваяСтрокаДокумента.Количество);	
		КонецЕсли;  
		
		НоваяСтрокаДокумента.ГТД = СтрокаНайтиТовар.НомерГТД;
		НоваяСтрокаДокумента.Страна = СтрокаНайтиТовар.КодСтраныПроисхождения; 
		
		Если ЗначениеЗаполнено(НоваяСтрокаДокумента.Номенклатура) Тогда
			
			СерияНоменклатуры = НайтиСерию(НоваяСтрокаДокумента.Номенклатура, СтрокаНайтиТовар.КодСтраныПроисхождения, СтрокаНайтиТовар.НомерГТД); 
			
			Если НЕ ЗначениеЗаполнено(СерияНоменклатуры) Тогда  
				
				ЕстьОшибки = Истина;
				НоваяСтрокаДокумента.ЕстьОшибка = Истина;   
				НоваяСтрокаДокумента.ОписаниеОшибки = "Не удалось создать серию"
				
			Иначе    
				НоваяСтрокаДокумента.СерияНоменклатуры = СерияНоменклатуры ; 
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПромТаблТовары;
	
КонецФункции

Функция ЗаполнитьТабличнуюЧастьИзПараметраДляПТОХ(ПоставщикТОХ, ТЗНоменклатура, ЕстьОшибки)

	ПромТаблТовары = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент().Товары.Выгрузить(,"Номенклатура,СерияНоменклатуры,ЕдиницаИзмерения,Коэффициент,Количество,Цена,Сумма,СуммаНДС"); 
	ПромТаблТовары.Колонки.Добавить("ЕстьОшибка", Новый ОписаниеТипов("Булево")); 
	ПромТаблТовары.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50))); 
	ПромТаблТовары.Колонки.Добавить("ФормализованныйКод", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50))); 
	ПромТаблТовары.Колонки.Добавить("КодПроизводителя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50))); 
	ПромТаблТовары.Колонки.Добавить("ГТД", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));	
	ПромТаблТовары.Колонки.Добавить("Страна", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ПромТаблТовары.Колонки.Добавить("Производитель", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	
	Для Каждого СтрокаНайтиТовар Из ТЗНоменклатура Цикл 
		
		НоваяСтрокаДокумента =  ПромТаблТовары.Добавить(); 
		
		ПромАртикул = СокрЛП(СтрокаНайтиТовар.ФормализованныйКод);
		НормализованныйАртикул = НормализоватьКодпроизводителя(ПромАртикул);
		Производитель = СокрЛП(СтрокаНайтиТовар.Производитель);
		
		Если НЕ ЗначениеЗаполнено(Производитель) И ЗначениеЗаполнено(ПромАртикул) И ПоставщикТОХ.ПроизводителиПоУмолчанию.Количество() > 0 Тогда				
			
			Для Каждого СтрПроизв Из ПоставщикТОХ.ПроизводителиПоУмолчанию Цикл
				
				СтрокаНайтиТовар.Производитель = СокрЛП(СтрПроизв.ПроизводительПоУмолчанию.Наименование);
				ЕстьНоменклатура = НайтиНоменклатуру(ПромАртикул,СтрокаНайтиТовар.Производитель);
				
				Если Не ЕстьНоменклатура = Неопределено Тогда
					Прервать;
				КонецЕсли;					
				
			КонецЦикла;
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(Производитель) И ЗначениеЗаполнено(ПромАртикул) Тогда
				СтрокаНайтиТовар.Производитель = СокрЛП(ПоставщикТОХ.ПроизводительПоУмолчанию.Наименование);
			КонецЕсли;				
			
			ЕстьНоменклатура = НайтиНоменклатуру(ПромАртикул,СтрокаНайтиТовар.Производитель);	
			
		КонецЕсли;
								
		Если ЕстьНоменклатура = Неопределено Тогда      
			
			ЕстьНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
			ЕстьОшибки = Истина;
			НоваяСтрокаДокумента.ЕстьОшибка = Истина;   
			НоваяСтрокаДокумента.ОписаниеОшибки = "Товар не найден"
			
		КонецЕсли; 

		НоваяСтрокаДокумента.Производитель = Производитель;
		НоваяСтрокаДокумента.КодПроизводителя = ПромАртикул;
		НоваяСтрокаДокумента.ФормализованныйКод = НормализованныйАртикул; 
		НоваяСтрокаДокумента.Номенклатура = ЕстьНоменклатура;		
		НоваяСтрокаДокумента.ЕдиницаИзмерения  = НоваяСтрокаДокумента.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрокаДокумента.Коэффициент = НоваяСтрокаДокумента.ЕдиницаИзмерения.Коэффициент;
		НоваяСтрокаДокумента.Количество = Число(СтрокаНайтиТовар.Количество);
		НоваяСтрокаДокумента.Сумма = Число(СтрокаНайтиТовар.Сумма); 
		НоваяСтрокаДокумента.СуммаНДС = Число(СтрокаНайтиТовар.СуммаНДС);  
		НоваяСтрокаДокумента.Цена = 0;        
		
		Если НоваяСтрокаДокумента.Сумма = 0 И НЕ НоваяСтрокаДокумента.Цена = 0 Тогда 
			НоваяСтрокаДокумента.Сумма = НоваяСтрокаДокумента.Цена * НоваяСтрокаДокумента.Количество; 
		ИначеЕсли НЕ НоваяСтрокаДокумента.Сумма = 0 И  НоваяСтрокаДокумента.Цена = 0 Тогда 
			НоваяСтрокаДокумента.Цена = НоваяСтрокаДокумента.Сумма / ?(НоваяСтрокаДокумента.Количество = 0, 1, НоваяСтрокаДокумента.Количество);	
		КонецЕсли;  
		
		НоваяСтрокаДокумента.ГТД = СтрокаНайтиТовар.НомерГТД;
		НоваяСтрокаДокумента.Страна = СтрокаНайтиТовар.КодСтраныПроисхождения; 
		
		Если ЗначениеЗаполнено(НоваяСтрокаДокумента.Номенклатура) Тогда
			
			СерияНоменклатуры = НайтиСерию(НоваяСтрокаДокумента.Номенклатура, СтрокаНайтиТовар.КодСтраныПроисхождения, СтрокаНайтиТовар.НомерГТД); 
			
			Если НЕ ЗначениеЗаполнено(СерияНоменклатуры) Тогда  
				
				ЕстьОшибки = Истина;
				НоваяСтрокаДокумента.ЕстьОшибка = Истина;   
				НоваяСтрокаДокумента.ОписаниеОшибки = "Не удалось создать серию"
				
			Иначе    
				НоваяСтрокаДокумента.СерияНоменклатуры = СерияНоменклатуры; 
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПромТаблТовары;

КонецФункции

Функция НормализоватьКодпроизводителя(ПромКодПроизводителя)  
	
	ОчищенныйКодПроизводителя = "";
	СтрокаПроверки = СокрЛП(ПромКодПроизводителя);
	Длина = СтрДлина(СтрокаПроверки); 
	
	Для а = 1 По Длина Цикл
		
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
			ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);  
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат  ОчищенныйКодПроизводителя;
	
КонецФункции

Функция НайтиСерию(Номенклатура , Страна , ГТД) 
	
	Если НЕ ЗначениеЗаполнено(ГТД) Тогда 
		ГТД = "--"; 
	КонецЕсли;  
	
	НомерГТД = Справочники.НомераГТД.НайтиПоКоду(ГТД);
	
	Если НомерГТД <> Справочники.НомераГТД.ПустаяСсылка() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Владелец = &Владелец
		|	И СерииНоменклатуры.НомерГТД = &НомерГТД";
		
		Запрос.УстановитьПараметр("НомерГТД", НомерГТД);
		Запрос.УстановитьПараметр("Владелец", Номенклатура);  
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе 
			
			НоваяСерияНоменклатуры = Справочники.СерииНоменклатуры.СоздатьЭлемент();
			НоваяСерияНоменклатуры.Наименование = НомерГТД;
			НоваяСерияНоменклатуры.Владелец = Номенклатура;
			НоваяСерияНоменклатуры.НомерГТД = НомерГТД;
			НоваяСерияНоменклатуры.СтранаПроисхождения = ПолучитьСтрану(Страна); 
			
			Если НоваяСерияНоменклатуры.СтранаПроисхождения.Пустая() Тогда
				Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();  
			КонецЕсли;  
			
			НоваяСерияНоменклатуры.Записать();    
			
			Возврат НоваяСерияНоменклатуры.Ссылка; 
			
		КонецЕсли;
		
	Иначе 
		
		// Создаю новую ГТД. Затем серию с этой ГТД  и присваиваю её этой номенклатуре
		НоваяГТД = Справочники.НомераГТД.СоздатьЭлемент();
		НоваяГТД.Код = ГТД;
		НоваяГТД.Записать();
		
		НоваяСерияНоменклатуры = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		НоваяСерияНоменклатуры.Наименование = НоваяГТД.Код;
		НоваяСерияНоменклатуры.Владелец = Номенклатура;
		НоваяСерияНоменклатуры.НомерГТД = НоваяГТД.Ссылка;
		НоваяСерияНоменклатуры.СтранаПроисхождения = ПолучитьСтрану(Страна);
		НоваяСерияНоменклатуры.Записать();   
		
		Возврат   НоваяСерияНоменклатуры.Ссылка;
		
	КонецЕсли;  
	
КонецФункции

Функция ПолучитьСтрану(Страна)
	
	Если ЗначениеЗаполнено(Страна) Тогда 
		
		Страна_ = Справочники.КлассификаторСтранМира.НайтиПоКоду(Страна);
		Если   НЕ Страна_.Пустая() Тогда  
			Возврат Страна_ ;   
		Иначе       
			Возврат Справочники.КлассификаторСтранМира.Россия;
		КонецЕсли;	  
		
	Иначе     
		Возврат Справочники.КлассификаторСтранМира.Россия;  
	КонецЕсли;
	
КонецФункции

Функция НайтиНоменклатуру(КодНоменклатуры,Производитель)
	
	ОчищенныйПроизводитель = "";
	СтрокаПроверки = ВРег(СокрЛП(Производитель));
	Длина = СтрДлина(СтрокаПроверки);   
	
	Для а = 1 По Длина Цикл
		
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
			ОчищенныйПроизводитель = ОчищенныйПроизводитель + Сред(СтрокаПроверки, а, 1);
		КонецЕсли; 
		
	КонецЦикла;	
	
	ОчищенныйКодПроизводителя = "";
	СтрокаПроверки = СокрЛП(КодНоменклатуры);
	Длина = СтрДлина(СтрокаПроверки);   
	
	Для а = 1 По Длина Цикл    
		
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
			ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);
		КонецЕсли;   
		
	КонецЦикла;
	
	СтрокаПоиска = ОчищенныйПроизводитель + ОчищенныйКодПроизводителя; 
	
	Если Не ПустаяСтрока(СтрокаПоиска) Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.НормализованныйКод = &СтрокаПоиска
		|	И НЕ Номенклатура.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() >= 1  И Выборка.Следующий() Тогда
			Товар = Выборка.Ссылка;
		Иначе 
			Товар = Неопределено;	
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Товар = Неопределено Тогда 
		
		// ищем бренд в синонимах
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СинонимыПроизводителей.Производитель КАК Производитель,
		|	СинонимыПроизводителей.СинонимПроизводителя
		|ИЗ
		|	РегистрСведений.СинонимыПроизводителей КАК СинонимыПроизводителей
		|ГДЕ
		|	СинонимыПроизводителей.СинонимПроизводителя = &СинонимПроизводителя";
		
		Запрос.УстановитьПараметр("СинонимПроизводителя", ВРег(СокрЛП(Производитель)));    
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Если Выборка.Количество() >= 1 И Выборка.Следующий() Тогда
			
			ОчищенныйПроизводитель = "";
			СтрокаПроверки = ВРег(СокрЛП(Выборка.Производитель));
			Длина = СтрДлина(СтрокаПроверки);  
			
			Для а = 1 По Длина Цикл  				
				
				Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
					ОчищенныйПроизводитель = ОчищенныйПроизводитель + Сред(СтрокаПроверки, а, 1);
				КонецЕсли;    
				
			КонецЦикла;				
			
			Если Не ПустаяСтрока(СтрокаПоиска) Тогда 
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.НормализованныйКод = &СтрокаПоиска
				|	И НЕ Номенклатура.ПометкаУдаления";
				
				Запрос.УстановитьПараметр("СтрокаПоиска",СтрокаПоиска);  
				
				ВыборкаТовар = Запрос.Выполнить().Выбрать();  
				
				Если ВыборкаТовар.Количество()>=1 И ВыборкаТовар.Следующий() Тогда
					Товар = ВыборкаТовар.Ссылка;
				Иначе 
					Товар = Неопределено;
				КонецЕсли; 
				
			Иначе  				
				Товар = Неопределено;
			КонецЕсли; 
			  		
		Иначе
			Товар = Неопределено;  		
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Товар;
	
КонецФункции

Функция СоздатьНовуюСтрочкуВДокументе(СтруктураСтроки)
	
	НоваяСтрокаДокумента =  СтруктураСтроки.Документ.Товары.Добавить();
	НоваяСтрокаДокумента.Номенклатура 		= СтруктураСтроки.Номенклатура ;
	НоваяСтрокаДокумента.ЕдиницаИзмерения  	= НоваяСтрокаДокумента.Номенклатура.ЕдиницаХраненияОстатков;
	НоваяСтрокаДокумента.Коэффициент 		= НоваяСтрокаДокумента.ЕдиницаИзмерения.Коэффициент;
	
	Если СтруктураСтроки.ЗаказПокупателяУказан И СтруктураСтроки.ТекСтрока <> Неопределено Тогда 
		НоваяСтрокаДокумента.Заказ 				= СтруктураСтроки.ТекСтрока.ЗаказПокупателя;
	КонецЕсли;
	
	Если СтруктураСтроки.БратьУказанноеКоличество Тогда 
		НоваяСтрокаДокумента.Количество = СтруктураСтроки.ТекКоличество;
	Иначе
		НоваяСтрокаДокумента.Количество = Мин(СтруктураСтроки.ТекСтрока.КоличествоЗаказаноПокупателем, СтруктураСтроки.ТекКоличество);
	КонецЕсли;
	
	Если СтруктураСтроки.ЗаказПоставщикуУказан Тогда 
		НоваяСтрокаДокумента.ЗаказПоставщику 	= СтруктураСтроки.ЗаказПоставщику;
	КонецЕсли;
	
	НоваяСтрокаДокумента.СерияНоменклатуры 	= СтруктураСтроки.СерияНоменклатуры;
	//+Гавриленков В. 19.12.2025 #UT10-5598
	//НоваяСтрокаДокумента.СтавкаНДС 			= СтруктураСтроки.Номенклатура.СтавкаНДС;
	НоваяСтрокаДокумента.СтавкаНДС 			= УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(СтруктураСтроки.Номенклатура, СтруктураСтроки.Документ.Дата);
	//-Гавриленков В. 19.12.2025 #UT10-5598
	
	//+Гавриленков В. 21.01.2026 #UT10-5645
	ЗначениеСтавки = УчетНДС.ПолучитьСтавкуНДС(НоваяСтрокаДокумента.СтавкаНДС);
	ЗначениеДляРасчета = ЗначениеСтавки / (100 + ЗначениеСтавки);
	//-Гавриленков В. 21.01.2026 #UT10-5645
	
	НоваяСтрокаДокумента.Цена 			= СтруктураСтроки.Цена;
	НоваяСтрокаДокумента.Сумма 			= НоваяСтрокаДокумента.Цена * НоваяСтрокаДокумента.Количество;
	//+Гавриленков В. 21.01.2026 #UT10-5645
	//НоваяСтрокаДокумента.СуммаНДС 		= НоваяСтрокаДокумента.Сумма * 20 / 120;
	НоваяСтрокаДокумента.СуммаНДС 		= НоваяСтрокаДокумента.Сумма * ЗначениеДляРасчета;
	//-Гавриленков В. 21.01.2026 #UT10-5645
	
	Возврат НоваяСтрокаДокумента;   
	
КонецФункции

Функция НайтиЭлементВНесозданныхПТУ(СтороннийСклад, НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика)    
	
	ЗапросНесозданногоПТУ = Новый Запрос;
	ЗапросНесозданногоПТУ.Текст =
	"ВЫБРАТЬ
	|	НеСозданныеПТУ.Ссылка КАК НесозданнныйПТУСсылка
	|ИЗ
	|	Справочник.НеСозданныеПТУ КАК НеСозданныеПТУ
	|ГДЕ
	|	НеСозданныеПТУ.СтороннийСклад = &СтороннийСклад
	|	И НеСозданныеПТУ.НомерПоДаннымПоставщика = &НомерПоДаннымПоставщика
	|	И НеСозданныеПТУ.ДатаПоДаннымПоставщика = &ДатаПоДаннымПоставщика
	|	И НЕ НеСозданныеПТУ.ПометкаУдаления";
	
	ЗапросНесозданногоПТУ.УстановитьПараметр("СтороннийСклад", СтороннийСклад);
	ЗапросНесозданногоПТУ.УстановитьПараметр("НомерПоДаннымПоставщика", НомерПоДаннымПоставщика);
	ЗапросНесозданногоПТУ.УстановитьПараметр("ДатаПоДаннымПоставщика", ДатаПоДаннымПоставщика);
	
	РезультатЗапросаНесозданногоПТУ = ЗапросНесозданногоПТУ.Выполнить();
	
	Если НЕ РезультатЗапросаНесозданногоПТУ.Пустой() Тогда 
		
		ВыборкаНесозданногоПТУ = РезультатЗапросаНесозданногоПТУ.Выбрать(); 
		ВыборкаНесозданногоПТУ.Следующий();
		Возврат ВыборкаНесозданногоПТУ.НесозданнныйПТУСсылка;
		
	Иначе
		Возврат Справочники.НеСозданныеПТУ.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

Процедура ОтправитьПТУвУТ11(ПТУ)

	ТекЗаказПоставщику = ПТУ.Товары[0].ЗаказПоставщику;
	
	Если ТекЗаказПоставщику.ТранзитнаяПоставкаЧерезСкладWMS Тогда		
		МСКWEB.ОтправитьПТУВУТ11(ПТУ.Ссылка);				
	КонецЕсли;

КонецПроцедуры
